# DormerCutProblemWarn Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CutFailures..::..DormerCutProblemWarn Property
BuiltInFailures..::..CutFailures Class See Also
---
Dormer Opening Cut is not fully defined. Cut was not performed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DormerCutProblemWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DormerCutProblemWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DormerCutProblemWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CutFailures Class
Autodesk.Revit.DB Namespace